[
  {
    "title": "Projects",
    "desc": "A collection of my best GitHub projects.",
    "items": [
      {
        "title": "Van Drivers",
        "desc": "A web app (Node, AngularJS, MongoDB) that organizes van scheduling for my university's climbing team. The app is deployed on Heroku and integrates into our team's Slack channel.",
        "url": "https://github.com/alexcrist/van-drivers"
      },
      {
        "title": "New Hampshire Wildlife Guide",
        "desc": "A project that first scrapes wildlife information and photographs from the internet using Python, then assembles the scraped data into a PDF using Lua and LaTeX. I made this to learn about web scraping and as a gift for my university's outdoor's club.",
        "url": "https://github.com/alexcrist/new-hampshire-wildlife-guide"
      },
      {
        "title": "Raspberry Pi Photo Booth",
        "desc": "This project turns a Raspberry Pi into a home photo booth. The Pi runs a web server that tells the Pi to take a photo whenever a particular route is hit, then serve the photo in an HTTP response. This allows users to visit the Pi's internal IP address from their phones when on the same network and view the photo back on their phone immediately.",
        "url": "https://github.com/alexcrist/raspberry-pi-photo-booth"
      },
      {
        "title": "Neural Network",
        "desc": "An exploration into machine learning inspired after watching Google's AlphaGo domninate at Go using deep neural networks. This simple Python network has one hidden layer and can be applied to a variety of numerical datasets.",
        "url": "https://github.com/alexcrist/neural-network"
      },
      {
        "title": "This Website",
        "desc": "Meta! This is my personal website to summarize my major projects, skills, and work experience. Simple, responsive, and flexible enough to allow variable numbers of sections and sub-sections depending on the data given in the JSON content file.",
        "url": "http://github.com/alexcrist/alexcrist.github.io"
      }
    ]
  },
  {
    "title": "Skills",
    "desc": "Technologies I enjoy and have experience with.",
    "items": [
      {
        "title": "Javascript",
        "desc": "I've used Javascript to develop web applications in profressional environments (WHOOP, MITRE) sometimes in conjunction with Node.js, React, or AngularJS. I enjoy using Javascript when starting up new projects for its lightweight syntax and flexible interpretation."
      },
      {
        "title": "Python",
        "desc": "My favorite language and go-to choice for most non-web-app projects. I've been writing Python since highschool and have used it most recently for developing internal tools at WHOOP."
      },
      {
        "title": "Java",
        "desc": "My experience with Java comes from writing Android applications and university coursework. I enjoy using Java when working with multiple people because of its verbose syntax. Designing object relationships using extension and interfacing is also undeniably satisfying when many working with many related objects."
      },
      {
        "title": "HTML, CSS, SASS",
        "desc": "I've become comfortable with these front-end technologies through my experiences at WHOOP and MITRE. With any front-end, I find the concrete, visual result that always comes from the work to be rewarding."
      },
      {
        "title": "Bash, Vim, Git",
        "desc": "With some occasional Googling, I know my way around Bash and the command line including writing code with Vim, SSHing into machines, and committing/merging/rebasing code with Git."
      },
      {
        "title": "C++, Racket",
        "desc": "Limited experience attained exclusively from university coursework."
      }
    ]
  },
  {
    "title": "Experience",
    "desc": "Places I've worked as a developer.",
    "items": [
      {
        "title": "WHOOP",
        "desc": "January - June 2017. Six month web developer co-op. Maintained and improved existing projects (AngularJS web application, marketing website, internal Python tools). Helped start new projects (web quiz to capture new e-mails, SVG conversion service). Represented a developer voice in meetings with product team.",
        "url": "http://whoop.com"
      },
      {
        "title": "MITRE",
        "desc": "January - June 2016. Six month web developer co-op. Created an admin web interface for a new project using AngularJS. Contributed features and fixes to existing suite of AngularJS web applications.",
        "url": "http://www.mitre.org"
      },
      {
        "title": "LiquidPlanner",
        "desc": "June - August 2015. Three month Android developer internship. Ignited the upgrade of the Android application to the latest Gradle tools. Added new features and fixed bugs in existing Android application.",
        "url": "http://www.liquidplanner.com"
      }
    ]
  }
]
